jack77er/openUTRUSTA/Packages/.cache/Keil.TMPM3_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>TMPM3_DFP</name>
  <description>Toshiba TX03 Series Device Support</description>

  <releases>
    <release version="1.2.0" date="2015-07-16">
      Added TMPM381 device support.
      Added TMPM383 device support.
    </release>
    <release version="1.1.0" date="2014-11-26">
      Corrected Flash Programming Algorithm for TMPM36BFYFG.
    </release>
    <release version="1.0.0">
      First Release version of TMPM3 Device Family Pack for the TX03 Series.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Toshiba</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Toshiba</keyword>
    <keyword>TMPM3</keyword>
    <keyword>TX03</keyword>
  </keywords>

  <devices>
    <family Dfamily="TX03 Series" Dvendor="Toshiba:92">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book name="Documents\dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
The TX03 microcontroller series embeds an ARM Cortex-M3 core, which provides high code density and fast interrupt response times required for real-time applications.
The TX03 Series also incorporates a Toshiba-proprietary NANO FLASH™ memory featuring high capacity and low power consumption.
      </description>

      <feature type="WDT"           n="1"/>

      <!-- ************************  Subfamily 'M330'  **************************** -->
      <subFamily DsubFamily="M330">
        <feature type="Timer"         n="10"      m="16"/>
        <feature type="RTC"           n="1"       m="32768"/>
        <feature type="VCC"           n="2.70"    m="3.60"/>

        <!-- *************************  Device 'TMPM330FDFG'  ***************************** -->
        <device Dname="TMPM330FDFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM330.h"/>
          <debug svd="SVD\M330.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM330_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents\TMPM330FDFG_datasheet_en_20101006.pdf" title="M330FDFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM330FDWFG'  ***************************** -->
        <device Dname="TMPM330FDWFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM330.h"/>
          <debug svd="SVD\M330.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM330_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents\TMPM330FDWFG_datasheet_en_20130805.pdf" title="M330FDWFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM330FWFG'  ***************************** -->
        <device Dname="TMPM330FWFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM330.h"/>
          <debug svd="SVD\M330.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM330_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents\TMPM330FWFG_datasheet_en_20101006.pdf" title="M330FWFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM330FYFG'  ***************************** -->
        <device Dname="TMPM330FYFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM330.h"/>
          <debug svd="SVD\M330.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM330_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents\TMPM330FYFG_datasheet_en_20101006.pdf" title="M330FYFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM330FYWFG'  ***************************** -->
        <device Dname="TMPM330FYWFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM330.h"/>
          <debug svd="SVD\M330.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM330_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents\TMPM330FYWFG_datasheet_en_20130805.pdf" title="M330FYWFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="2"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM332FWUG'  ***************************** -->
        <device Dname="TMPM332FWUG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM332.h"/>
          <debug svd="SVD\M332.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM33x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents\TMPM332FWUG_datasheet_en_20101006.pdf" title="M332FWUG Reference Manual"/>

          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="ComOther"      n="1"                           name="CEC Remote Control preprocessor"/>
          <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
          <feature type="ExtInt"        n="5"/>
          <feature type="IOs"           n="44"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'TMPM333FDFG'  ***************************** -->
        <device Dname="TMPM333FDFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM333.h"/>
          <debug svd="SVD\M333.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM33x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents\TMPM333FDFG_datasheet_en_20101006.pdf" title="M333FDFG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="I2C"           n="3"                           name="I2C/SIO"/>
          <feature type="ADC"           n="12"      m="10"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="78"/>
          <feature type="Temp"          n="-20"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

