jack77er/openUTRUSTA/Packages/.cache/Keil.TMPM3_DFP.1.2.0.pdsc
          <book name="Documents\TMPM365FYXBG_datasheet_en_20130612.pdf"                     title="M365FYXBG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="105"/>
        </device>

        <!-- *************************  Device 'TMPM366FDFG'  ***************************** -->
        <device Dname="TMPM366FDFG">
          <processor Dclock="48000000"/>
          <compile header="Device\Include\TMPM366.h"/>
          <debug svd="SVD\M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents\TMPM366FDFG_datasheet_en_20130611.pdf"                      title="M366FDFG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM366FDXBG'  ***************************** -->
        <device Dname="TMPM366FDXBG">
          <processor Dclock="48000000"/>
          <compile header="Device\Include\TMPM366.h"/>
          <debug svd="SVD\M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM36x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents\TMPM366FDXBG_datasheet_en_20130611.pdf"                     title="M366FDXBG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="BGA"           n="109"/>
        </device>

        <!-- *************************  Device 'TMPM366FWFG'  ***************************** -->
        <device Dname="TMPM366FWFG">
          <processor Dclock="48000000"/>
          <compile header="Device\Include\TMPM366.h"/>
          <debug svd="SVD\M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM36x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents\TMPM366FWFG_datasheet_en_20130611.pdf" title="M366FWFG Reference Manual"/>

          <feature type="DMA"           n="4"/>
          <feature type="MPSerial"      n="3"/>
          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="USART"         n="1"/>
          <feature type="I2C"           n="2"                           name="I2C/SIO"/>
          <feature type="USBD"          n="1"/>
          <feature type="ADC"           n="12"      m="12"/>
          <feature type="Timer"         n="10"      m="16"/>
          <feature type="ExtInt"        n="10"/>
          <feature type="Other"         n="2"                           name="CS/WAIT Controller"/>
          <feature type="IOs"           n="74"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM366FWXBG'  ***************************** -->
        <device Dname="TMPM366FWXBG">
          <processor Dclock="48000000"/>
          <compile header="Device\Include\TMPM366.h"/>
          <debug svd="SVD\M366.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM36x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

