jack77er/openUTRUSTA/Packages/.cache/Keil.TMPM3_DFP.1.2.0.pdsc
          <book name="Documents\TMPM373FWDUG_datasheet_en_20130412.pdf" title="M373FWDUG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="37"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'TMPM374FWUG'  ***************************** -->
        <device Dname="TMPM374FWUG">
          <processor Dclock="80000000"/>
          <compile header="Device\Include\TMPM374.h"/>
          <debug svd="SVD\M374.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM37x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents\TMPM374FWUG_datasheet_en_20130415.pdf" title="M374FWUG Reference Manual"/>

          <feature type="UART"          n="3"                           name="UART/SIO"/>
          <feature type="ADC"           n="6"       m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="7"/>
          <feature type="IOs"           n="33"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="44"/>
        </device>

        <!-- *************************  Device 'TMPM375FSDMG'  ***************************** -->
        <device Dname="TMPM375FSDMG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM375.h"/>
          <debug svd="SVD\M375.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM37x_64.FLM" start="0x00000000" size="0x00010000"             default="1"/>

          <book name="Documents\TMPM375FSDMG_datasheet_en_20130830.pdf" title="M375FSDMG Reference Manual"/>

          <feature type="UART"          n="2"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C/SIO"/>
          <feature type="ADC"           n="4"       m="12"/>
          <feature type="Timer"         n="4"       m="16"/>
          <feature type="PWM"           n="1"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="1"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="3"/>
          <feature type="IOs"           n="21"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="SOP"           n="30"/>
        </device>

        <!-- *************************  Device 'TMPM376FDDFG'  ***************************** -->
        <device Dname="TMPM376FDDFG">
          <processor Dclock="80000000"/>
          <compile header="Device\Include\TMPM376.h"/>
          <debug svd="SVD\M376.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM37x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents\TMPM376FDDFG_datasheet_en_20130412.pdf" title="M376FDDFG Reference Manual"/>

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C/SIO"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="82"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM376FDFG'  ***************************** -->
        <device Dname="TMPM376FDFG">
          <processor Dclock="80000000"/>
          <compile header="Device\Include\TMPM376.h"/>
          <debug svd="SVD\M376.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM37x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents\TMPM376FDFG_datasheet_en_20130412.pdf" title="M376FDFG Reference Manual"/>

          <feature type="UART"          n="4"                           name="UART/SIO"/>
          <feature type="I2C"           n="1"                           name="I2C/SIO"/>
          <feature type="ADC"           n="22"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
          <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
          <feature type="ExtInt"        n="16"/>
          <feature type="IOs"           n="82"/>
          <feature type="Temp"          n="-40"     m="85"/>
          <feature type="QFP"           n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'M380'  **************************** -->
      <subFamily DsubFamily="M380">
        <feature type="MPSerial"      n="2"/>
        <feature type="UART"          n="5"                           name="UART/SIO"/>
        <feature type="I2C"           n="2"                           name="I2C/SIO"/>
        <feature type="Other"         n="1"                           name="Remote Control Preprocessor"/>
        <feature type="PWM"           n="2"                           name="Three Phase PWM Output"/>
        <feature type="Other"         n="2"                           name="Incremental Encoder Input"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="RTC"           n="1"       m="32768"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- *************************  Device 'TMPM380FWDFG'  ***************************** -->
        <device Dname="TMPM380FWDFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM380.h"/>
          <debug svd="SVD\M380.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM38x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents\TMPM380FWDFG_datasheet_en_20110317.pdf" title="M380FWDFG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="TimerOther"    n="3"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="IOs"           n="84"/>
          <feature type="VCC"           n="4.00"    m="5.50"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM380FWFG'  ***************************** -->
        <device Dname="TMPM380FWFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM380.h"/>
          <debug svd="SVD\M380.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM38x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents\TMPM380FWFG_datasheet_en_20110317.pdf" title="M380FWFG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="TimerOther"    n="3"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="IOs"           n="84"/>
          <feature type="VCC"           n="4.00"    m="5.50"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM380FYDFG'  ***************************** -->
        <device Dname="TMPM380FYDFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM380.h"/>
          <debug svd="SVD\M380.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM38x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents\TMPM380FYDFG_datasheet_en_20110317.pdf" title="M380FYDFG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="TimerOther"    n="3"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="IOs"           n="84"/>
          <feature type="VCC"           n="4.00"    m="5.50"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM380FYFG'  ***************************** -->
        <device Dname="TMPM380FYFG">
          <processor Dclock="40000000"/>
          <compile header="Device\Include\TMPM380.h"/>
          <debug svd="SVD\M380.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM38x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents\TMPM380FYFG_datasheet_en_20110317.pdf" title="M380FYFG Reference Manual"/>

          <feature type="DMA"           n="2"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="TimerOther"    n="3"                           name="Multi-Purpose Timer (MPT)"/>
          <feature type="IOs"           n="84"/>
          <feature type="VCC"           n="4.00"    m="5.50"/>
          <feature type="QFP"           n="100"/>
        </device>

