jack77er/openUTRUSTA/Packages/.cache/Keil.TMPM3_DFP.1.2.0.pdsc
        <!-- *************************  Device 'TMPM390FWFG'  ***************************** -->
        <device Dname="TMPM390FWFG">
          <processor Dclock="20000000"/>
          <compile header="Device\Include\TMPM390.h"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM39x_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents\NotAvailable.pdf" title="TMPM390FWFG Reference Manual"/-->

          <feature type="MPSerial"      n="1"/>
          <feature type="ExtInt"        n="8"/>
          <feature type="IOs"           n="74"/>
          <feature type="QFP"           n="100"/>
        </device>

        <!-- *************************  Device 'TMPM395FWAXBG'  ***************************** -->
        <device Dname="TMPM395FWAXBG">
          <processor Dclock="20000000"/>
          <compile header="Device\Include\TMPM395.h"/>
          <debug svd="SVD\M395.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash\TMPM395_128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <!--book name="Documents\NotAvailable.pdf" title="TMPM395FWAXBG Reference Manual"/-->

          <feature type="MPSerial"      n="4"/>
          <feature type="ExtInt"        n="11"/>
          <feature type="IOs"           n="91"/>
          <feature type="BGA"           n="120"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM330 CMSIS">
      <description>Toshiba TMPM330 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM330*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM332 CMSIS">
      <description>Toshiba TMPM332 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM332*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM333 CMSIS">
      <description>Toshiba TMPM333 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM333*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM341 CMSIS">
      <description>Toshiba TMPM341 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM341*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM342 CMSIS">
      <description>Toshiba TMPM342 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM342*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM343 CMSIS">
      <description>Toshiba TMPM343 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM343*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM361 CMSIS">
      <description>Toshiba TMPM361 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM361*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM362 CMSIS">
      <description>Toshiba TMPM362 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM362*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM363 CMSIS">
      <description>Toshiba TMPM363 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM363*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM364 CMSIS">
      <description>Toshiba TMPM364 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM364*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM365 CMSIS">
      <description>Toshiba TMPM365 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM365*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM366 CMSIS">
      <description>Toshiba TMPM366 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM366*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM367 CMSIS">
      <description>Toshiba TMPM367 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM367*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM368 CMSIS">
      <description>Toshiba TMPM368 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM368*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM369 CMSIS">
      <description>Toshiba TMPM369 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM369*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM36B CMSIS">
      <description>Toshiba TMPM36B devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM36B*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM370 CMSIS">
      <description>Toshiba TMPM370 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM370*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM372 CMSIS">
      <description>Toshiba TMPM372 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM372*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM373 CMSIS">
      <description>Toshiba TMPM373 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM373*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM374 CMSIS">
      <description>Toshiba TMPM374 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM374*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM375 CMSIS">
      <description>Toshiba TMPM375 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM375*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
