jack77er/openUTRUSTA/Packages/.cache/Keil.TMPM3_DFP.1.2.0.pdsc
    <condition id="TMPM376 CMSIS">
      <description>Toshiba TMPM376 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM376*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM380 CMSIS">
      <description>Toshiba TMPM380 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM380*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM381 CMSIS">
      <description>Toshiba TMPM381 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM381*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM383 CMSIS">
      <description>Toshiba TMPM383 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM383*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM384 CMSIS">
      <description>Toshiba TMPM384 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM384*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM390 CMSIS">
      <description>Toshiba TMPM390 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM390*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM395 CMSIS">
      <description>Toshiba TMPM395 devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM395*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup TMPM330 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM330 CMSIS">
      <description>System Startup for Toshiba TMPM330 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM330.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM330.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM332 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM332 CMSIS">
      <description>System Startup for Toshiba TMPM332 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM332.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM332.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM333 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM333 CMSIS">
      <description>System Startup for Toshiba TMPM333 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM333.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM333.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM341 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM341 CMSIS">
      <description>System Startup for Toshiba TMPM341 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM341.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM341.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM342 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM342 CMSIS">
      <description>System Startup for Toshiba TMPM342 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM342.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM342.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM343 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM343 CMSIS">
      <description>System Startup for Toshiba TMPM343 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM343.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM343.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM361 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM361 CMSIS">
      <description>System Startup for Toshiba TMPM361 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM361.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM361.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM362 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM362 CMSIS">
      <description>System Startup for Toshiba TMPM362 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM362.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM362.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

