jack77er/openUTRUSTA/Packages/.cache/Keil.TMPM3_DFP.1.2.0.pdsc
    <!-- Startup TMPM380 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM380 CMSIS">
      <description>System Startup for Toshiba TMPM380 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM380.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM380.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM381 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM381 CMSIS">
      <description>System Startup for Toshiba TMPM381 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM381.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM381.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM383 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM383 CMSIS">
      <description>System Startup for Toshiba TMPM383 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM383.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM383.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM384 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM384 CMSIS">
      <description>System Startup for Toshiba TMPM384 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM384.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM384.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM390 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM390 CMSIS">
      <description>System Startup for Toshiba TMPM390 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM390.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM390.c"         attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup TMPM395 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM395 CMSIS">
      <description>System Startup for Toshiba TMPM395 Devices</description>
      <files>
        <file category="include" name="Device\Include\"/>
        <file category="source"  name="Device\Source\ARM\startup_TMPM395.s"    attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_TMPM395.c"         attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

  <boards>
    <board vendor="Keil" name="MCBTMPM330" revision="v1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBTMPM330=ON">
      <description>Keil MCBTMPM330 Board Support and Examples</description>
      <image small="Boards\Keil\MCBTMPM330\Documents\mcbtmpm330_board.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcbtmpm330/" title="MCBTMPM330 Web Page"/>
      <book category="schematic" name="Boards\Keil\MCBTMPM330\Documents\mcbtmpm330-schematics.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM330FDFG"/>
      <compatibleDevice deviceIndex="0" Dvendor="Toshiba:92" DsubFamily="M330"/>
      <feature type="XTAL"      n="10000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"              name="Push-buttons: DPH1, NMI and Reset"/>
      <feature type="LED"       n="3"              name="LEDs: Power, User: green, yellow, red"/>
      <feature type="Poti"      n="1"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
      <feature type="CustomFF"  n="100" m="70"/>
    </board>

    <board vendor="Toshiba" name="BMSKTOPASM369" revision="v1" salesContact="http://www.toshiba-components.com/microcontroller/Cortex_SKs.html" orderForm="http://www.toshiba-components.com/microcontroller/Cortex_SKs.html">
      <description>Toshiba BMSKTOPASM369 Board Support and Examples</description>
      <image small="Boards\Toshiba\BMSKTOPASM369\Documents\BMSKTOPASM369_small.png"
             large="Boards\Toshiba\BMSKTOPASM369\Documents\BMSKTOPASM369_large.png"/>
      <book category="overview" name="Boards\Toshiba\BMSKTOPASM369\Documents\6154E.pdf" title="Overview"/>
      <mountedDevice    deviceIndex="0" Dvendor="Toshiba:92" Dname="TMPM369FDFG"/>
      <compatibleDevice deviceIndex="0" Dvendor="Toshiba:92" DsubFamily="M360"/>
      <feature type="XTAL"      n="16000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="ETH"       n="1"              name="10/100MBit Ethernet"/>
      <feature type="MemCard"   n="1"              name="MicroSD Card Holder"/>
      <feature type="PWR"       n="5" m="12"       name="Extern Powered"/>
      <feature type="Joystick"  n="1"              name="5-position Joystick"/>
      <feature type="USB"       n="1"              name="Full-Speed USB device"/>
      <feature type="USB"       n="1"              name="Full-Speed USB host"/>
      <feature type="LED"       n="8"              name="LEDs: User: green"/>
      <feature type="ConnOther" n="1"              name="Cortex Debug &amp; Trace Interface"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCBTMPM330\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCBTMPM330" vendor="Keil" Dvendor="Toshiba:92" Dname="TMPM330FDFG"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Toshiba\BMSKTOPASM369\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="BMSKTOPASM369" vendor="Toshiba" Dvendor="Toshiba:92" Dname="TMPM369FDFG"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
